Repository: guilhermelinosp/recipe-book-api
Catalog: Source/Shared/RecipeBook.Exceptions/ErrorMessages.*.resx
Languages: pt

# CATEGORIA_RECEITA_INVALIDA
source: The recipe category is invalid.
pt: A categoria da receita é inválida.

# CODIGO_NAO_ENCONTRADO
source: Code not found.
pt: Código não encontrado.

# EMAIL_JA_REGISTRADO
source: The user's email provided is already registered.
pt: O e-mail informado já esta registrado na base de dados.

# EMAIL_USUARIO_EMBRANCO
source: The user's email must be provided.
pt: O e-mail do usuário deve ser informado.

# EMAIL_USUARIO_INVALIDO
source: The user's email is invalid.
pt: O e-mail do usuário é inválido.

# ERRO_DESCONHECIDO
source: Unknown error.
pt: Erro desconhecido.

# ESTA_CONEXAO_JA_EXISTE
source: This connection already exists.
pt: Esta conexão já existe.

# LOGIN_INVALIDO
source: The user's email and/or password are incorrect.
pt: O e-mail e/ou senha estão incorretos.

# MODOPREPARO_RECEITA_EMBRANCO
source: The recipe preparation method must be informed.
pt: O modo de preparo da receita deve ser informado.

# NOME_USUARIO_EMBRANCO
source: The user's name must be provided.
pt: O nome do usuário deve ser informado.

# RECEITA_INGREDIENTES_REPETIDOS
source: There are repeated ingredients in your list.
pt: Exitem ingredientes repetidos na sua lista.

# RECEITA_INGREDIENTE_PRODUTO_EMBRANCO
source: The ingredient product must be informed.
pt: O produto do ingrediente deve ser informado.

# RECEITA_INGREDIENTE_QUANTIDADE_EMBRANCO
source: The quantity of the ingredient must be informed.
pt: A quantidade do ingrediente deve ser informada.

# RECEITA_MINIMO_UM_INGREDIENTE
source: The recipe must have at least one ingredient.
pt: A receita deve ter no mínimo um ingrediente.

# RECEITA_NAO_ENCONTRADA
source: Recipe not found.
pt: Receita não encontrada.

# SENHA_ATUAL_INVALIDA
source: Current password is invalid.
pt: Senha atual é inválida.

# SENHA_USUARIO_EMBRANCO
source: The user's password must be entered.
pt: A senha do usuário deve ser informada.

# SENHA_USUARIO_MINIMO_OITO_CARACTERES
source: The user's password must contain at least 8 characters.
pt: A senha deve conter no minimo 8 caracteres.

# TELEFONE_JA_REGISTRADO
source: The user's phone number has already been registered.
pt: O telefone do usuário ja foi registrado

# TELEFONE_USUARIO_EMBRANCO
source: The user's phone number must be provided.
pt: O telefone do usuário deve ser informado.

# TELEFONE_USUARIO_INVALIDO
source: The user's phone number must be in the format XXXXXXXXXXX
pt: O telefone do usuário deve estar no formato XXXXXXXXXXX

# TEMPO_PREPARO_INVALIDO
source: The preparation time is invalid.
pt: O tempo de preparo é invalido.

# TITULO_RECEITA_EMBRANCO
source: The title of the recipe must be provided.
pt: O título da receita deve ser informado.

# TOKEN_EXPIRADO
source: The token has expired
pt: Faça login novamente no App.

# USUARIO_NAO_ENCONTRADO
source: The user not found
pt: Usuário não encontrado

# USUARIO_SEM_PERMISSAO
source: You do not have permission to access this resource.
pt: Você não tem permissão para acessar este recurso.

# VOCE_NAO_PODE_EXECUTAR_ESTA_OPERACAO
source: You cannot perform this operation.
pt: Você não pode executar esta operação.
